tap "d12frosted/emacs-plus"
tap "lyraphase/right2repair"
brew "aspell"
brew "baobab"
brew "ncurses"
brew "bash"
brew "openssl@3"
brew "bat"
brew "binutils"
brew "cdecl"
brew "choose-rust"
brew "cmake"
brew "coreutils"
brew "cpdf"
brew "curl"
brew "diffutils"
brew "dos2unix"
brew "exiftool"
brew "python@3.14"
brew "fancy-cat"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "grep"
brew "gzip"
brew "imagemagick"
brew "img2pdf"
brew "less"
brew "llvm"
brew "lsd"
brew "lua"
brew "make"
brew "man-db"
brew "mas"
brew "mcfly"
brew "mplayer"
brew "yt-dlp"
brew "mpv"
brew "ncdu"
brew "neovim"
brew "node"
brew "pandoc"
brew "parallel"
brew "pdftk-java"
brew "perl"
brew "python@3.13"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "sd"
brew "sevenzip"
brew "showkey"
brew "smartmontools"
brew "stow"
brew "tlrc"
brew "tree-sitter"
brew "unzip"
brew "uv"
brew "vim"
brew "vivid"
brew "watch"
brew "wget"
brew "xpdf"
brew "xsel"
brew "zip"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-debug", "with-imagemagick", "with-savchenkovaleriy-big-sur-icon", "with-xwidgets"]
cask "alfred"
cask "alt-tab"
cask "altserver"
cask "anki"
cask "appcleaner"
cask "applite"
cask "coteditor"
cask "cursorcerer"
cask "db-browser-for-sqlite"
cask "discord"
cask "eclipse-java"
cask "foobar2000"
cask "freac"
cask "gas-mask"
cask "ghostty"
cask "google-chrome"
cask "imazing"
cask "jdownloader"
cask "jubler"
cask "karabiner-elements"
cask "kid3"
cask "kitty"
cask "lulu"
cask "mactex-no-gui"
cask "makemkv"
cask "mediahuman-audio-converter"
cask "mendeley-reference-manager"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "mkvtoolnix-app"
cask "music-presence"
cask "namechanger"
cask "neovide-app"
cask "obsidian"
cask "prismlauncher"
cask "qbittorrent"
cask "quarto"
cask "rectangle"
cask "roblox"
cask "signal"
cask "sioyek"
cask "soulseek"
cask "steam"
cask "temurin@17"
cask "temurin@21"
cask "visual-studio-code"
cask "vmware-fusion@13.5.2"
cask "wezterm"
cask "xld"
cask "xnviewmp"
cask "zoom"
cask "zulu@8"
mas "NepTunes", id: 1006739057
mas "Silicio", id: 933627574
vscode "astral-sh.ty"
vscode "asvetliakov.vscode-neovim"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "google.colab"
vscode "james-yu.latex-workshop"
vscode "johnnymorganz.stylua"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cpptools"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "sumneko.lua"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-pack"
vscode "xaver.clang-format"
